samples/SOAP XML/IPS/IPSUploadRun1_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <IPSUploadRun1 xmlns="http://webservices.iress.com.au/v4/">
      <Input>
        <Header>
          <ServiceSessionKey>45f48bd6-91cd-43ad-bbe3-2a9b3a14b99b@IDS-TEST</ServiceSessionKey>
          <RequestID>B0950A26-FC56-4A6C-8352-9A64A43B5091</RequestID>
          <Updates>false</Updates>
          <Timeout>25</Timeout>
          <PageSize>1000</PageSize>
          <WaitForResponse>true</WaitForResponse>
          <PagingBookmark />
          <PagingDirection>0</PagingDirection>
          <InputLocalizationType>0</InputLocalizationType>
          <OutputLocalizationType>0</OutputLocalizationType>
        </Header>
        <Parameters>
          <UploadID>33880</UploadID>
          <UploadAction>Start</UploadAction>
        </Parameters>
      </Input>
    </IPSUploadRun1>
  </soap:Body>
</soap:Envelope>